= Banking Example
:neo4j-version: 2.0.0-RC1
:author: Greg King
:tags: domain:generic, use-case:data-analysis

To be completed

'''

== Sample Data Set

//setup
[source,cypher]
----

// Create claims

CREATE (claim1:Claim
		{ 	name: 			"Claim 1",
			Domains: 		["Dom1"],
			Organisations: 	["Org1"]
			}
		)

CREATE (claim2:Claim
		{ 	name: 			"Claim 2",
			Domains: 		["Dom1"],
			Organisations: 	["Org1","Org2"]
			}
		)
		
CREATE (claim3:Claim
		{ 	name: 			"Claim 3",
			Domains: 		["Dom1"],
			Organisations: 	["Org2"]
			}
		)

// Create addresses

CREATE (address1:Address
		{ 	name: 			"Address 1",
			Domains: 		[],
			Organisations: 	[]
			}
		)

// Create people
		
CREATE (person1:Person
		{ 	name: 			"Person 1",
			Domains: 		[],
			Organisations: 	[]
			}
		)

CREATE (person2:Person
		{ 	name: 			"Person 2",
			Domains: 		[],
			Organisations: 	[]
			}
		)

CREATE (person3:Person
		{ 	name: 			"Person 3",
			Domains: 		[],
			Organisations: 	[]
			}
		)

// Create relationships

CREATE (claim1)-[:ER]->(address1)
CREATE (claim2)-[:ER]->(address1)
CREATE (claim3)-[:ER]->(address1)
		
CREATE (claim1)-[:ER]->(person1)
CREATE (claim2)-[:ER]->(person2)
CREATE (claim3)-[:ER]->(person3);

RETURN *
----

//graph

'''


==== Calculate the derived Org/Domains for the entities

[source,cypher]
----
// Note: Use of reduce to flatten lists
// This approach ends up dupicating values, which is not ideal, but still works with following logic.  Method do de-dup not immediately obvious in Cypher
MATCH (e)
// Finding things that don't yet have Domains/Orgs (ie entities)
WHERE size(e.Organisations) = 0 AND size(e.Domains) = 0
MATCH (e)<-[r:ER]-(d)
WITH e,REDUCE(output = [], r IN collect(d.Organisations) | output + r) as Organisations, REDUCE(output = [], r IN collect(d.Domains) | output + r) as Domains
SET e.Organisations = Organisations, e.Domains = Domains
RETURN e
----

//output
//table


==== Find the nodes a user has ALL Org/Dom permissions to see 
[source,cypher]
----
// Set the Domain and Organisation permissions permitted
WITH ["Org2","Org5"] as Orgs, ["Dom1","Dom2"] as Doms
MATCH (n)
WHERE 	all(x in n.Organisations where x in Orgs)
		AND
		all(x in n.Domains where x in Doms)
RETURN n
----

//graph
